/********************************************************************************
*
*
*                                 木目智能电子
*
*
* 文件名称: example.c
* 创建日期: 19-10-25
* 文件描述: 示例文件，此处添加该文件的描述，功能等
*
********************************************************************************/
#include <stdio.h>
#include "example.h"

static unsigned int s_u32Var;

static void s_vExampleFunc(void);

/********************************************************************************
*函数定义: void g_vExampleFunc(void)
*函数功能: 调用文件作用域函数
*修改记录: 
*日期:                作者:                摘要:
      19-11-06             YummoShin            Create
********************************************************************************/
void g_vExampleFunc(void)
{
    g_u32Var = 0;
    s_vExampleFunc();
}

/********************************************************************************
*函数定义: static void s_vExampleFunc(void)
*函数功能: 文件作用域函数
*修改记录: 
*日期:                作者:                摘要:
      19-11-06             YummoShin            Create
********************************************************************************/
static void s_vExampleFunc(void)
{
    return 0;
}