/*==============================================================================
*
*                                 木目智能电子
*
*产品名称 : 
*
*文件名称 : example.c
*实现功能 : 示例文件，此处添加该文件的相关说明，实现功能等
*软件作者 : Yummo
*创建时间 : 2019-11-07
==============================================================================*/
#include <stdio.h>
#include "example.h"

//文件作用域参数在开头声明，文件内静态变量，参数名前加's_'表示静态变量，'u32'表示数据类型
static unsigned int s_u32Var;

static void s_vExampleFunc(void); //文件作用域函数在开头声明

/********************************************************************************
*函数定义: void g_vExampleFunc(void)
*函数功能: 接口函数定义，调用文件作用域函数，函数名前'g_'表示全局函数，'v'返回void类型
*修改记录: 
*日期:                作者:                摘要:
      19-11-06             YummoShin            Create
      19-11-09             YummoShin            Update
********************************************************************************/
void g_vExampleFunc(void)
{
    g_u32Var = 1;
    s_u32Var = 1;
    s_vExampleFunc();
}

/********************************************************************************
*函数定义: static void s_vExampleFunc(void)
*函数功能: 文件作用域函数在主调函数后面，函数名前's_'表示静态函数，'v'返回'void'
*修改记录: 
*日期:                作者:                摘要:
      19-11-06             YummoShin            Create
      19-11-09             YummoShin            Update
********************************************************************************/
static void s_vExampleFunc(void)
{
    unsigned int u32Val=0; //局部函数，
    static unsigned int s_u32Val=0; //局部静态变量，名字前加's_'

    u32Val = s_u32ExampleFunc();
    s_u32Val = u32Val;
}

/*******************************************************************************
*函数名称 : static unsigned int s_u8ExampleFunc(void)
*返回参数 : 文件作用域函数，有返回值，函数名前'g_'表示静态函数，'u32'返回u32类型
*函数功能 : 
*作者 :               日期 :                    摘要 :
*      Yummo                2019-11-09                创建
*******************************************************************************/
static unsigned int s_u32ExampleFunc(void)
{
    unsigned int rtn;

    return rtn;
}
